string title = @"
   ____            _            _  __               _           _       _                             
  / ___|__ _  __ _| | __ _ _ __| |/ /__ _ _ __ __ _| |__  _   _| |_   _| |_        ___ ___  _ __ ___  
 | |   / _` |/ _` | |/ _` | '__| ' // _` | '__/ _` | '_ \| | | | | | | | __|      / __/ _ \| '_ ` _ \ 
 | |__| (_| | (_| | | (_| | |  | . \ (_| | | | (_| | |_) | |_| | | |_| | |_   _  | (_| (_) | | | | | |
  \____\__,_|\__, |_|\__,_|_|  |_|\_\__,_|_|  \__,_|_.__/ \__,_|_|\__,_|\__| (_)  \___\___/|_| |_| |_|
             |___/                                                                                    
                                                                         
░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░   02-operatorler    ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
";
Console.Title = ("02-operatorler");
Console.WriteLine(title);


string baslik01 = @"
---------------------------------------------------------------------------------------------------------
                                        Atama ve İşlemli Atama                                                
---------------------------------------------------------------------------------------------------------";
Console.WriteLine($"\n\n\n\n\n{baslik01}\n");
int x = 5;
int y = 6;

y = y + 2;
y += 2;  // üsttekinin kısa syntaxı

x = x * 4;
x *= 4;  //kısa syntax

//Console.WriteLine("x:" + x + "\n" + "y: " + y);
Console.WriteLine($" x: {x} \n y: {y}");


string baslik02 = @"
---------------------------------------------------------------------------------------------------------
                                    Mantıksal Operatorler  // &&, ||, !                                                
---------------------------------------------------------------------------------------------------------";
Console.WriteLine($"\n\n\n\n\n{baslik02}\n");
bool isTrue = true;
bool isFalse = false;

// ve 
if (isTrue && isFalse)
{
    Console.WriteLine("false");
}

// veya
if (isTrue || isFalse)
{
    Console.WriteLine("true");
}

// değildir/tersi
if (isTrue && !isFalse)
{
    Console.WriteLine("true");
}

string baslik03 = @"
---------------------------------------------------------------------------------------------------------
                                İlişkisel Operatorler  <,>,<=,>=,==,!=                                                
---------------------------------------------------------------------------------------------------------";
Console.WriteLine($"\n\n\n\n\n{baslik03}\n");
int sayi1 = 10;
int sayi2 = 20;
bool sonuc = sayi1 != sayi2;
Console.WriteLine(sonuc); //  true


string baslik04 = @"
---------------------------------------------------------------------------------------------------------
                                   Aritmetik Operatorler  *,/,+,-                                                
---------------------------------------------------------------------------------------------------------";
Console.WriteLine($"\n\n\n\n\n{baslik04}\n");
int a = 35;
int b = 7;
int sonuc2 = a / b;
Console.WriteLine(sonuc2); // Çıktı 5



string baslik05 = @"
---------------------------------------------------------------------------------------------------------
                                            Mod Alma                                                
---------------------------------------------------------------------------------------------------------";
Console.WriteLine($"\n\n\n\n\n{baslik05}\n");
int c = a % 4;
Console.WriteLine(c); // Çıktı 3




Console.WriteLine("\n\n\n\n\n\n\n Çıkmak için Enter.");
Console.ReadKey();
